# IFCLinkDocumentExportScope Properties

---
The IFCLinkDocumentExportScope type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
IFCLinkDocumentExportScope Class
Autodesk.Revit.DB.IFC Namespace